tutorials/Leonov/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
5.0 wt.% solution of polyisobutylene in tetradecane
*/

type Leonov;
rho              [1 -3 0 0 0 0 0] 803.87097;
etaS             [1 -1 -1 0 0 0 0] 0.002;
etaP             [1 -1 -1 0 0 0 0] 1.422;
lambda           [0 0 1 0 0 0 0] 0.03;


// ************************************************************************* //
